Revit 2027 API
FormatOptions.CanSuppressTrailingZeros Method
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSuppressTrailingZeros()
Public Function CanSuppressTrailingZeros As Boolean
public:
bool CanSuppressTrailingZeros()
member CanSuppressTrailingZeros : unit -> bool
Return Value
Boolean
 True if trailing zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
CanSuppressTrailingZeros Overload
Autodesk.Revit.DB Namespace